Repository: synth-inc/onit
Catalog: macos/OnitSideKick/Models.xcstrings
Source language: en
Languages: fr

source: to use %@ models at cost.
fr: pour utiliser les modèles %@ avec un coût.

source: to use Onit with local models. Models running locally on Ollama will be available here.
fr: pour utiliser Onit avec des modèles locaux. Les modèles fonctionnant localement sur Ollama seront disponibles ici.

source: A provider with this name already exists.
fr: Un fournisseur avec ce nom existe déjà.

source: API Key
fr: Clé API

source: Add a new model
fr: Ajouter un nouveau modèle

source: Add a new provider
fr: Ajouter un nouveau fournisseur

source: Add new
fr: Ajouter nouveau

source: Advanced
fr: Avancé

source: Are you sure you want to remove this provider?
fr: Êtes-vous sûr de vouloir supprimer ce fournisseur ?

source: Cancel
fr: Annuler

source: Context Window
fr: Fenêtre de contexte

source: Context window:
fr: Fenêtre de contexte :

source: Controls how long the model will stay loaded into memory following the request
fr: Contrôle combien de temps le modèle restera chargé en mémoire après la requête

source: Controls how long to wait for a response from the model before timing out (in seconds)
fr: Contrôle combien de temps attendre une réponse du modèle avant l'expiration (en secondes)

source: Couldn't find any models at the provided URL.
fr: Aucun modèle trouvé à l'URL fournie.

source: Custom Model
fr: Modèle personnalisé

source: Custom Providers
fr: Fournisseurs personnalisés

source: Custom provider cannot have the same name as a built-in provider.
fr: Un fournisseur personnalisé ne peut pas avoir le même nom qu'un fournisseur intégré.

source: Default models
fr: Modèles par défaut

source: Default:
fr: Par défaut :

source: Display Name
fr: Nom d'affichage

source: Download Ollama
fr: Télécharger Ollama

source: Duration string (e.g. '10m', '24h') or integer seconds
fr: Chaîne de durée (ex. '10m', '24h') ou secondes entières

source: Endpoint URL:
fr: URL du point d'accès :

source: Enter your %@ API key
fr: Entrez votre clé API %@

source: Failed to fetch models: %@
fr: Échec de la récupération des modèles : %@

source: Failed to verify token.
fr: Échec de la vérification du token.

source: Filter by display name
fr: Filtrer par nom d'affichage

source: Float (0.0 - 1.0)
fr: Décimal (0.0 - 1.0)

source: Float (0.0 - 2.0)
fr: Décimal (0.0 - 2.0)

source: If enabled, Onit streams partial responses from model providers, offering quicker replies. This may not function with all providers.
fr: Si activé, Onit diffuse les réponses partielles des fournisseurs de modèles, offrant des réponses plus rapides. Cela peut ne pas fonctionner avec tous les fournisseurs.

source: Integer
fr: Entier

source: Integer (seconds)
fr: Entier (secondes)

source: Invalid format. Use duration (e.g. 10m, 24h) or seconds
fr: Format invalide. Utilisez une durée (ex. 10m, 24h) ou des secondes

source: Invalid model name.
fr: Nom de modèle invalide.

source: Keep Alive
fr: Maintenir en vie

source: Keep alive:
fr: Maintenir en vie :

source: Local Models
fr: Modèles Locaux

source: Local endpoint must be a valid URL
fr: Le point d'accès local doit être une URL valide

source: Manually add remote models from other providers.
fr: Ajouter manuellement des modèles distants d'autres fournisseurs.

source: Model
fr: Modèle

source: Model Name *
fr: Nom du modèle *

source: Model already added.
fr: Modèle déjà ajouté.

source: Model deprecated
fr: Modèle obsolète

source: Models loaded successfully!
fr: Modèles chargés avec succès !

source: Must be a number between 0.0 and 1.0
fr: Doit être un nombre entre 0.0 et 1.0

source: Must be a number between 0.0 and 2.0
fr: Doit être un nombre entre 0.0 et 2.0

source: Must be a positive integer
fr: Doit être un entier positif

source: NEW
fr: NOUVEAU

source: No models
fr: Aucun modèle

source: No models.
fr: Aucun modèle.

source: Other providers / private models
fr: Autres fournisseurs / modèles privés

source: Provider Name
fr: Nom du fournisseur

source: Reduces the probability of generating nonsense. A higher value (e.g. 100) will give more diverse answers, while a lower value (e.g. 10) will be more conservative
fr: Réduit la probabilité de générer des absurdités. Une valeur plus élevée (ex. 100) donnera des réponses plus diverses, tandis qu'une valeur plus basse (ex. 10) sera plus conservatrice

source: Refresh
fr: Actualiser

source: Reload
fr: Recharger

source: Remote
fr: Distant

source: Remote Models
fr: Modèles Distants

source: Remove
fr: Retirer

source: Remove Provider
fr: Supprimer le fournisseur

source: Remove Selected
fr: Supprimer la sélection

source: Remove added models
fr: Supprimer les modèles ajoutés

source: Removed Models
fr: Modèles supprimés

source: Request Timeout
fr: Délai d'expiration

source: Request timeout (seconds):
fr: Délai d'expiration (secondes) :

source: Restore Defaults
fr: Restaurer les valeurs par défaut

source: Search models
fr: Rechercher des modèles

source: Select All
fr: Tout sélectionner

source: Set
fr: Définir

source: Sets the size of the context window used to generate the next token
fr: Définit la taille de la fenêtre de contexte utilisée pour générer le prochain token

source: Sign Up to Access All Providers!
fr: Inscrivez-vous pour accéder à tous les fournisseurs !

source: Stream responses
fr: Diffuser les réponses

source: Successfully verified token!
fr: Token vérifié avec succès !

source: Supports System Prompts
fr: Prend en charge les prompts système

source: Supports Tool Calling
fr: Prend en charge l'appel d'outils

source: Supports Vision
fr: Prend en charge la vision

source: Temperature
fr: Température

source: Temperature:
fr: Température :

source: The base URL should not include the API version or endpoint (for example, for OpenRouter, use 'https://openrouter.ai/api', not 'https://openrouter.ai/api/v1' or 'https://openrouter.ai/api/v1/models').
fr: L'URL de base ne doit pas inclure la version de l'API ou le point de terminaison (par exemple, pour OpenRouter, utilisez 'https://openrouter.ai/api', pas 'https://openrouter.ai/api/v1' ou 'https://openrouter.ai/api/v1/models').

source: The temperature of the model. Increasing the temperature will make the model answer more creatively
fr: La température du modèle. Augmenter la température rendra les réponses du modèle plus créatives

source: Unable to verify model. Please try again.
fr: Impossible de vérifier le modèle. Veuillez réessayer.

source: Unselect All
fr: Tout désélectionner

source: Verified
fr: Vérifié

source: Verify & Add
fr: Vérifier et ajouter

source: Verify & Save
fr: Vérifier et Enregistrer

source: Verify →
fr: Vérifier →

source: Verifying
fr: Vérification

source: Works together with top-k. A higher value (e.g., 0.95) will lead to more diverse text, while a lower value (e.g., 0.5) will generate more focused and conservative text
fr: Fonctionne avec top-k. Une valeur plus élevée (ex. 0.95) produira un texte plus diversifié, tandis qu'une valeur plus basse (ex. 0.5) générera un texte plus ciblé et conservateur

source: You can put in
fr: Vous pouvez saisir

source: You have used up all of your chat generations. Your next renewal is: %@.
fr: Vous avez épuisé toutes vos générations de chat. Votre prochain renouvellement est le : %@.

source: e.g. 10m, 24h, -1, 3600
fr: ex. 10m, 24h, -1, 3600

source: your %@ key
fr: votre clé %@
